Revit 2026 API

# ElementWorksetFilter Class

---

A filter used to match elements which reside in a given workset.

SystemObject Autodesk.Revit.DBElementFilter Autodesk.Revit.DBElementQuickFilter Autodesk.Revit.DBElementWorksetFilter

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ElementWorksetFilter : ElementQuickFilter
```
```vb
Public Class ElementWorksetFilter
	Inherits ElementQuickFilter
```
```cpp
public ref class ElementWorksetFilter : public ElementQuickFilter
```
```fsharp
type ElementWorksetFilter =
    class
        inherit ElementQuickFilter
    end
```

The ElementWorksetFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ElementWorksetFilter(WorksetId) | Constructs a new instance of a filter to match elements in a given workset. |
|  | ElementWorksetFilter(WorksetId, Boolean) | Constructs a new instance of a filter to match elements in a given workset. |

|  | Name | Description |
| --- | --- | --- |
|  | Inverted | True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected, and elements that would normally be rejected will be accepted. (Inherited from ElementFilter) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from ElementFilter) |
|  | WorksetId | The workset id. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from ElementFilter) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | PassesFilter(Element) | Applies the filter to a given element. (Inherited from ElementFilter) |
|  | PassesFilter(Document, ElementId) | Applies the filter to a given element. (Inherited from ElementFilter) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

This filter is a quick filter.

#### Reference

Autodesk.Revit.DB Namespace